#=================================================================
# Есть ли статистически значимые различия в росте дочерей?
# Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165
# Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160
#======================================================================

from scipy.stats import ttest_ind

moms = [172, 177, 158, 170, 178, 175, 164, 160, 169, 165]
daughters = [173, 175, 162, 174, 175, 168, 155, 170, 160]

alpha = 0.05

stat, p = ttest_ind(moms, daughters)

print(f'Уровень статистической значимости α = {alpha}')
if p < alpha:
    print("Гипотеза о равенстве средних двух выборок отвергается.")
else:
    print("Не удалось отвергнуть гипотезу о равенстве средних двух выборок.")